04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_kOmegaSST_OF23/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(3.74847e-09 1.74259e-09 -3.62982e-32 3.74667e-09 1.50229e-34 3.74751e-09)
(3.90837e-09 1.81696e-09 -8.16422e-32 3.90628e-09 5.97289e-32 3.90745e-09)
(4.08813e-09 1.9006e-09 -6.72813e-32 4.08664e-09 3.61825e-31 4.08731e-09)
(4.27174e-09 1.98608e-09 -4.67219e-32 4.27064e-09 2.15073e-30 4.27115e-09)
(4.46572e-09 2.07636e-09 -2.88109e-32 4.46509e-09 -3.93256e-30 4.46528e-09)
(4.66737e-09 2.17024e-09 -1.89248e-32 4.66733e-09 -1.60008e-30 4.66719e-09)
(4.87374e-09 2.2663e-09 1.09324e-32 4.87417e-09 -2.91525e-30 4.87377e-09)
(5.08851e-09 2.36628e-09 -3.32108e-33 5.0895e-09 5.69728e-30 5.08877e-09)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 -0 0 6.66667e-16 0 6.66667e-16);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 -0 6.66667e-16 0 6.66667e-16);
    }
}


// ************************************************************************* //
