04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_kOmegaSST_OF23/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
3.42346e-11
3.58743e-11
3.77641e-11
3.97451e-11
4.18766e-11
4.41276e-11
4.64649e-11
4.8934e-11
...
)
;

boundaryField
{
    bottomWall
    {
        type            nutLowReWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 3.00359e-19;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            nutLowReWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 3.00359e-19;
    }
}


// ************************************************************************* //
